### [ env/poc ] terraform plan
```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_kubernetes_cluster.aks has been deleted
  - resource "azurerm_kubernetes_cluster" "aks" {
      - id                                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-comp-rg/providers/Microsoft.ContainerService/managedClusters/faspo-poc-aks" -> null
        name                                = "faspo-poc-aks"
      - oidc_issuer_url                     = "https://germanywestcentral.oic.prod-aks.azure.com/d46035c4-e4ae-4ea6-904f-6f343b7b5673/08ce482c-a53d-4603-9323-eafac0a453d2/" -> null
        tags                                = {}
        # (30 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.test-app-uami-fc will be created
  + resource "azurerm_federated_identity_credential" "test-app-uami-fc" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = (known after apply)
      + name                = "faspo-poc-test-app-uami-fc"
      + parent_id           = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-sec-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/faspo-poc-test-app-uami"
      + resource_group_name = "faspo-poc-sec-rg"
      + subject             = "system:serviceaccount:default:faspo-poc-test-app-sa"
    }

  # azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + current_kubernetes_version          = (known after apply)
      + dns_prefix_private_cluster          = "faspo-poc-aks-dns"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "germanywestcentral"
      + name                                = "faspo-poc-aks"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = "faspo-poc-aks-nodes-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/privateDnsZones/privatelink.germanywestcentral.azmk8s.io"
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "faspo-poc-comp-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = true

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + auto_scaling_enabled        = true
          + kubelet_disk_type           = (known after apply)
          + max_count                   = 10
          + max_pods                    = (known after apply)
          + min_count                   = 2
          + name                        = "default"
          + node_count                  = (known after apply)
          + node_labels                 = (known after apply)
          + orchestrator_version        = (known after apply)
          + os_disk_size_gb             = (known after apply)
          + os_disk_type                = "Managed"
          + os_sku                      = "Ubuntu"
          + scale_down_mode             = "Delete"
          + temporary_name_for_rotation = "rotation"
          + type                        = "VirtualMachineScaleSets"
          + ultra_ssd_enabled           = false
          + vm_size                     = "Standard_B2pls_v2"
          + vnet_subnet_id              = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/virtualNetworks/faspo-poc-vnet/subnets/faspo-poc-vnet-infra-subnet"
          + workload_runtime            = (known after apply)
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-sec-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/faspo-poc-aks-cp-uami",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + kubelet_identity {
          + client_id                 = "cd9a504a-8fcb-4208-a463-d3bc8226a5cb"
          + object_id                 = "14e5bee5-d463-4390-a00b-1fd8ab193f57"
          + user_assigned_identity_id = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-sec-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/faspo-poc-aks-nodepool-uami"
        }

      + network_profile {
          + dns_service_ip     = "10.0.3.254"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "10.0.3.0/24"
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # azurerm_private_endpoint.aks-pen must be replaced
-/+ resource "azurerm_private_endpoint" "aks-pen" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/privateEndpoints/faspo-poc-aks-pen" -> (known after apply)
        name                          = "faspo-poc-aks-pen"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/networkInterfaces/faspo-poc-aks-pen-nic"
              - name = "faspo-poc-aks-pen-nic"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/privateEndpoints/faspo-poc-aks-pen/privateDnsZoneGroups/faspo-poc-aks-pen-dns-zone-group/privateDnsZoneConfigs/privatelink.germanywestcentral.azmk8s.io"
              - name                = "privatelink.germanywestcentral.azmk8s.io"
              - private_dns_zone_id = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/privateDnsZones/privatelink.germanywestcentral.azmk8s.io"
              - record_sets         = []
            },
        ] -> (known after apply)
      - tags                          = {} -> null
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/privateEndpoints/faspo-poc-aks-pen/privateDnsZoneGroups/faspo-poc-aks-pen-dns-zone-group" -> (known after apply)
            name                 = "faspo-poc-aks-pen-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "aks-pen-connection"
          ~ private_connection_resource_id    = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-comp-rg/providers/Microsoft.ContainerService/managedClusters/faspo-poc-aks" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.2.9" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```
